{
  "name": "Serge Shibko",
  "title": "Java Developer/Fullstack Developer",
  "location": "Irkutsk, Russia (open to remote work in any time zone)",
  "contact": "Contacts",
  "phone": "+7 914 905 70 65",
  "email": "sshibkodev@gmail.com",
  "telegram": "@sergeshibko",
  "about_title": "About Me",
  "about_text": "Passionate Java developer with deep expertise in Spring ecosystem, microservices, and full-cycle software development. Strong analytical mindset, proven experience in high-load systems, and commitment to clean, maintainable code. I know many programming languages. Also I am a full-fledged Web developer",
  "skills_title": "Professional Skills",
  "experience_title": "Work Experience",
  "date_1": "Jug 2024 – Present",
  "date_2": "Jul 2022 – Aug 2024",
  "date_3": "Feb 2020 – Jul 2022",
  "education_title": "Education",
  "freelance": "Freelance Java/Fullstack Developer",
  "freelance.desc_1": "Independent development, deployment and maintenance of software of various complexity, from Telegram-bots to electronic commerce systems",
  "freelance.desc_2": "Full-cycle development: backend (Java, Spring Boot, PostgreSQL, Redis, Kafka) and frontend (ReactJS + JavaScript/TypeScript)",
  "freelance.desc_3": "Deployment via Docker and CI/CD pipelines.",
  "web_dynamics": "Java Developer at Web Dynamics, Vladivostok",
  "web_dynamics.desc1": "Participation in the full cycle of development and support of high-load web services and mobile applications.",
  "web_dynamics.desc2": "Implementation of new functionality and refinement of existing based on detailed analysis of technical specifications and code base.",
  "web_dynamics.desc3": "Efficient debugging and prompt elimination of defects, improving system stability.",
  "web_dynamics.desc4": "Development of modular and integration tests using JUnit and Mockito",
  "web_dynamics.desc5": "Active participation in architectural and design discussions, contributing to the adoption of optimal technical solutions.",
  "web_dynamics.desc6": "Code Review, aimed at improving the quality and maintainability of the code. Work with CI/CD pipelines",
  "web_dynamics.desc7": "Development and updating of technical documentation.",
  "web_dynamics.desc8": "Development and integration of Telegram-messenger-bots.",
  "web_dynamics.desc9": "Tech stack: Java, Spring Boot, REST API, Maven/Gradle, MySQL, PostgreSQL, Redis, Apache Kafka, Liquibase, JSP, XML, JS, HTML, ReactJS/TS, Git.",
  "web_dynamics.key_p": "Key Project: National platform «Digital agriculture» (customer - Russian Ministry of Agriculture): https://farmer112.ru/",
  "web_dynamics.key_p.desc1": "New functionality injection. Example action: Development and implementation of QR-code generation for goods/orders on the fly without constant reading/writing in the database. Result: optimization of the interaction process.",
  "web_dynamics.key_p.desc2":"Data management. Example action: Implementation of a mechanism for archiving and deleting inactive user accounts with data retention. Result: data archive + continuous stable DB operation and transactions",
  "web_dynamics.key_p.desc3":"Support and development: Support and development of existing functionality, refactoring of code and rapid troubleshooting",
  "web_dynamics.key_p.desc4":"API Development: Develop and update the REST API for various system modules",
  "web_dynamics.key_p.desc5": "Access management: Change and add roles of participants, set access rights.",
  "web_dynamics.key_p.desc6": "Database: New fields integration and editing existing entities and their relationships in different DB tables using Liquibase migrations",
  "open_source": "Open source",
  "open_source.desc":"Intensive study of Java-backend and Web-frontend development and active participation in Open Source projects, which allowed to apply the knowledge gained.",
  "digital_agro_project": "Key Project: National Digital Agriculture Platform (Ministry of Agriculture of Russia)",
  "project_url": "Project website",
  "bachelor": "Bachelor's Degree in Information Systems in Economics",
  "university": "Siberian Academy of Law, Economics and Management, Irkutsk (2009–2013)",
  "education_desc": "Studied: Pascal, VBS, C++, DataBaseManagementSystems, Linux, OS Administratrion, Networking, Applied Math, Economic.",
  "lang_en": "EN",
  "lang_ru": "RU",
  "resume_pdf": "Download CV (PDF)",
  "to_top": "↑ To Top"
}