{
  "name": "Шибко Сергей",
  "title": "Java-разработчик/Fullstack-разработчик",
  "location": "Иркутск, Россия (готов к удалённой работе в любом часовом поясе)",
  "contact": "Контакты",
  "phone": "+7 914 905 70 65",
  "email": "sshibkodev@gmail.com",
  "telegram": "@sergeshibko",
  "about_title": "Обо мне",
  "about_text": "Профессиональный Java-разработчик с глубокими знаниями Spring-экосистемы, микросервисной архитектуры и полного цикла разработки ПО. Аналитический склад ума, опыт работы с высоконагруженными системами и приверженность принципам чистого кода. Знаю и свободно читаю несколько языков программирования. Являюсь полноценным Web-разработчиком.",
  "skills_title": "Профессиональные навыки",
  "experience_title": "Опыт работы",
  "date_1": "Август 2024 – По настоящее время",
  "date_2": "Июль 2022 – Август 2024",
  "date_3": "Февраль 2020 – Июль 2022",
  "education_title": "Образование",
  "freelance": "Java/Fullstack разработчик (Фриланс)",
  "freelance.desc_1": "Самостоятельная разработка, деплой и сопровождение программного обеспечения различной сложности, от Telegram-ботов до систем электронной коммерции",
  "freelance.desc_2": "Полный цикл разработки: бэкенд (Java, Spring Boot, PostgreSQL, Redis, Kafka или NestJS/Next.js) и фронтенд (ReactJS + JavaScript/TypeScript)",
  "freelance.desc_3": "Деплой через Docker и CI/CD pipelines.",
  "web_dynamics": "Java-разработчик в Web Dynamics, Владивосток",
  "web_dynamics.desc1": "Участие в полном цикле разработки и сопровождения высоконагруженных веб-сервисов и бэкенда мобильных приложений.",
  "web_dynamics.desc2": "Имплементация нового функционала и доработка существующего на основе детального анализа технических заданий и кодовой базы.",
  "web_dynamics.desc3": "Эффективная отладка и оперативное устранение дефектов, повышение стабильности системы.",
  "web_dynamics.desc4": "Разработка модульных и интеграционных тестов с использованием JUnit и Mockito",
  "web_dynamics.desc5": "Активное участие в архитектурных и проектных обсуждениях, способствующее принятию оптимальных технических решений.",
  "web_dynamics.desc6": "Проведение Code Review, направленное на улучшение качества и поддерживаемости кода. Работа с CI/CD пайплайнами",
  "web_dynamics.desc7": "Разработка и актуализация технической документации.",
  "web_dynamics.desc8": "Разработка и интеграция Telegram-ботов.",
  "web_dynamics.desc9": "Стек технологий: Java, Spring Boot, REST API, Maven/Gradle, MySQL, PostgreSQL, Redis, Apache Kafka, Liquibase, JSP, XML, JS, HTML, ReactJS/TS, Git.",
  "web_dynamics.key_p": "Ключевой Проект: Национальная платформа «Цифровое сельское хозяйство» (заказчик – Минсельхоз России): https://farmer112.ru/",
  "web_dynamics.key_p.desc1": "Внедрение нового функционала. Пример: Разработка и имплементация генерации QR-кодов для товаров/ордеров на лету без постоянного чтения/записи в БД. Результат: оптимизация процесса взаимодействия.",
  "web_dynamics.key_p.desc2":"Управление данными. Пример: Реализация механизма архивации и удаления неактивных пользовательских аккаунтов с сохранением данных. Результат: архив данных + поддержание непрерывной стабильной работы БД и транзакций",
  "web_dynamics.key_p.desc3":"Поддержка и развитие: Поддержка и развитие существующего функционала, рефакторинг кода и оперативное устранение сбоев",
  "web_dynamics.key_p.desc4":"API Development: Разработка и доработка REST API для различных модулей системы",
  "web_dynamics.key_p.desc5": "Управление доступом: Изменение и добавление ролей участников, настройка прав доступа.",
  "web_dynamics.key_p.desc6": "Базы данных: Внедрение новых полей и редактирование существующих сущностей и их отношений в различных таблицах БД с использованием Liquibase migrations",
  "open_source": "Open source",
  "open_source.desc": "Интенсивное освоение Java-бэкенд и Web-фронтенд разработки и активное участие в Open Source проектах, позволившее на практике применить полученные знания.",
  "digital_agro_project": "Ключевой проект: Национальная платформа «Цифровое сельское хозяйство» (Минсельхоз России)",
  "project_url": "Сайт проекта",
  "bachelor": "Бакалавр по специальности «Информационные системы в экономике»",
  "university": "Сибирская Академия Права, Экономики и Управления, Иркутск (2003–2007)",
  "education_desc": "Изучал: Pascal, VBS, C++, различные СУБД, Linux, Администрирование ОС, Сети, Экономика, Прикладная математика.",
  "lang_en": "EN",
  "lang_ru": "RU",
  "resume_pdf": "Скачать резюме (PDF)",
  "to_top": "↑ В начало"
}